
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	НастройкаФормы();
КонецПроцедуры

&НаСервере
Процедура НастройкаФормы()
	
	Элементы.ГруппаОтладки.Доступность = Объект.РежимОтладки;
	
	Элементы.ГруппаВыгрузка.Видимость = Объект.КонфигурацияКонвертацииОбмена = ПредопределенноеЗначение("Перечисление.оду_КонфигурацияКонвертацииДанных.Произвольная");
	
КонецПроцедуры
 

&НаКлиенте
Процедура ПутьКОбработкиОтладкиНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ПолноеИмяФайла = пр_Клиент.ВыборКаталогаФайлаНачалоВыбора();
	Если ЗначениеЗаполнено(ПолноеИмяФайла)  Тогда
		Объект.ПутьКОбработкиОтладки = ПолноеИмяФайла; 
		Если НЕ ЗначениеЗаполнено(Объект.Код)  Тогда
		    Объект.Код = пр_Общий.ИмяФайлаПоПути(ПолноеИмяФайла);
		КонецЕсли; 
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПутьКПОДНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ПолноеИмяФайла = пр_Клиент.ВыборКаталогаФайлаНачалоВыбора();
	Если ЗначениеЗаполнено(ПолноеИмяФайла)  Тогда
		Объект.ПутьКПОД = ПолноеИмяФайла; 
		Объект.ПОДИзФайла = Истина; 
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПОДИзОбработкиБСППриИзменении(Элемент)
	Объект.ПОДИзФайла = НЕ Объект.ПОДИзОбработкиБСП;
КонецПроцедуры

&НаКлиенте
Процедура ПОДИзФайлаПриИзменении(Элемент)
	Объект.ПОДИзОбработкиБСП = НЕ Объект.ПОДИзФайла;
КонецПроцедуры

&НаКлиенте
Процедура РежимОтладкиПриИзменении(Элемент)  
	Элементы.ГруппаОтладки.Доступность = Объект.РежимОтладки;
КонецПроцедуры

&НаКлиенте
Процедура КонфигурацияКонвертацииОбменаПриИзменении(Элемент)
	НастройкаФормы();
КонецПроцедуры
