
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьРегламентОбмена(Команда)
	
	ВыполнитьРегламентОбменаНаСервере(); 
	
КонецПроцедуры

&НаСервере
Процедура ВыполнитьРегламентОбменаНаСервере()
	
	Модуль = пр_НастройкиПовтИсп.ИсполняемыйМодуль("оду_Общий", пр_НастройкиПовтИсп.ТекущийПользователь()); 
	НомерВыполнения = ?(ЗначениеЗаполнено(РежимОбмена), 2, 1);
	Модуль.ВыполнитьОбменВФоне(РежимОбмена, НомерВыполнения); 
	
КонецПроцедуры


&НаКлиенте
Процедура СбросПовторногоИспользования(Команда)
	ОбновитьПовторноИспользуемыеЗначения();	
КонецПроцедуры
