
Процедура ОбработкаКомандыУОД_ПоОбъекту(ПараметрКоманды, ПараметрыВыполненияКоманды) 	Экспорт
	
	//ПолныйПуть = "\\pivo.local\Resource\Личные\Кириллов ПС\r\work\! НавигаторОбщий.epf";
	//ОбщаяФорма = пр_Клиент.ПолучитьФормуПоПути(ПолныйПуть, "НавигаторОбщий", "Форма");
	//ОбщаяФорма.ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Если ПараметрКоманды.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ИмяТипа = пр_Общий.ИмяТипаXMLПоСсылке(ПараметрКоманды[0]);
	Если СтрНайти(ИмяТипа, "DocumentRef") > 0  Тогда
		МассивОбъектовОбмена = оду_Общий.ПроверитьМассивОбъектовОбмена(ПараметрКоманды, ИмяТипа, оду_ОбщийПовтИсп.ИДКонфигурации());
	Иначе
		МассивОбъектовОбмена = ПараметрКоманды;	
	КонецЕсли; 
	
	Если МассивОбъектовОбмена.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	МассивУчастниковОбмена = оду_ОбщийПовтИсп.МассивУчастниковОбменаПоТипуОбъектаСамолет(ИмяТипа);
	
	Если МассивУчастниковОбмена = Неопределено Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Объект не участвует в обмене через самолет";
		Сообщение.Сообщить(); 
		Возврат;
	КонецЕсли; 
	
	ТекущийПользователь = пр_НастройкиПовтИсп.ТекущийПользователь();
	
	Если МассивУчастниковОбмена.Количество() = 1 Тогда
		
		ПараметрыРегистрации = Новый Структура("МассивУчастниковОбмена, МассивОбъектовОбмена, ТекущийПользователь", МассивУчастниковОбмена, МассивОбъектовОбмена, ТекущийПользователь);
		//ОбработкаКомандыНаСервере(ПараметрыРегистрации);
		ЗарегистрироватьОбъектыОбменаСамолет(ПараметрыРегистрации);
		
	ИначеЕсли МассивУчастниковОбмена.Количество() > 1 Тогда
		
		////Открывать форму выбора участников обмена
		ПарамФормы = Новый Структура("МассивУчастниковОбмена, МассивОбъектовОбмена, ТекущийПользователь", МассивУчастниковОбмена, МассивОбъектовОбмена, ТекущийПользователь);
		//ОписОповещФормы = Новый ОписаниеОповещения("ПослеВыбораУчатникаОбмена", ЭтаФорма); //ЭтаФорма, ЭтотОбъект
		//Путь = "\\pivo.local\Resource\Личные\Кириллов ПС\r\work\С_оду_БазыУчастникиОбмена.epf";
		//пр_Клиент.ОткрытьФормуВнешнейОбработки(Путь, "ФормаВыбораУчастникаОбмена", ПарамФормы, , ОписОповещФормы);
		
		ОписОповещФормы = Новый ОписаниеОповещения("ПослеВыбораУчатникаОбмена", ЭтотОбъект); //ЭтаФорма, ЭтотОбъект
		ОткрытьФорму("Справочник.оду_БазыУчастникиОбмена.Форма.ФормаВыбораУчастникаОбмена", ПарамФормы,,,,, ОписОповещФормы, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца); 

	КонецЕсли; 
	
КонецПроцедуры


#Область  УОД_Самолет

Процедура ПослеВыбораУчатникаОбмена(ПараметрыВыбора, Параметры) Экспорт
	
	Если ПараметрыВыбора = Неопределено Тогда
		Возврат;	
	КонецЕсли; 
	
	ЗарегистрироватьОбъектыОбменаСамолет(ПараметрыВыбора);

КонецПроцедуры 

Процедура ЗарегистрироватьОбъектыОбменаСамолет(ПараметрыРегистрации)
	
	оду_Общий.ЗарегистрироватьОбъектыОбменаСамолет(ПараметрыРегистрации);
	
	оду_Общий.ВыполнитьОбменВФоне(оду_ОбщийПовтИсп.РежимВыгрузка(), 2);
	
КонецПроцедуры

#КонецОбласти
