
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если ЗначениеЗаполнено(Запись.ИДОбъекта) Тогда
		Если (Запись.РежимОбмена = оду_ОбщийПовтИсп.РежимВыгрузка() ИЛИ Запись.РежимОбмена = оду_ОбщийПовтИсп.РежимЗапросСсылки() ИЛИ Запись.РежимОбмена = оду_ОбщийПовтИсп.РежимЗапросДвижений())
				И ЗначениеЗаполнено(Запись.ТипXMLОбъектаИсточника)  Тогда
			Объект1С = пр_Общий.СсылкаПоТипXML(Запись.ТипXMLОбъектаИсточника, Запись.ИДОбъекта);
		ИначеЕсли  Запись.РежимОбмена = оду_ОбщийПовтИсп.РежимЗагрузка() И ЗначениеЗаполнено(Запись.ТипXMLОбъектаПриемника) Тогда 	
			Объект1С = пр_Общий.СсылкаПоТипXML(Запись.ТипXMLОбъектаПриемника, Запись.ИДОбъекта);
		КонецЕсли; 
	КонецЕсли; 
КонецПроцедуры
