
Функция receiverData(Запрос)
	Модуль = пр_НастройкиПовтИсп.ИсполняемыйМодуль("оду_Общий", Пользователи.ТекущийПользователь()); 
	Возврат Модуль.receiverData(Запрос);
КонецФункции

Функция ping(Запрос)
	Модуль = пр_НастройкиПовтИсп.ИсполняемыйМодуль("оду_Общий", Пользователи.ТекущийПользователь()); 
	Возврат Модуль.ping(Запрос);
КонецФункции

Функция exchangeStatus(Запрос)
	Модуль = пр_НастройкиПовтИсп.ИсполняемыйМодуль("оду_Общий", Пользователи.ТекущийПользователь()); 
	Возврат Модуль.exchangeStatus(Запрос);
КонецФункции

Функция exchangeData(Запрос)
	Модуль = пр_НастройкиПовтИсп.ИсполняемыйМодуль("оду_Общий", Пользователи.ТекущийПользователь()); 
	Возврат Модуль.exchangeData(Запрос);
КонецФункции

Функция exchangeStatusComplet(Запрос)
	Модуль = пр_НастройкиПовтИсп.ИсполняемыйМодуль("оду_Общий", Пользователи.ТекущийПользователь()); 
	Возврат Модуль.exchangeStatusComplet(Запрос);
КонецФункции
