
&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	//Проверка настроек
	оду_Общий.ПроверкаУзловОбмена();
	НастройкиФормы();
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	//
	//Если НЕ ЗначениеЗаполнено(Объект.Ссылка)  Тогда
	//
	//	
	//
	//КонецЕсли; 
	//
КонецПроцедуры
 
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	// Вставить содержимое обработчика.
КонецПроцедуры


&НаСервере
Процедура НастройкиФормы()
	
	Если Параметры.Свойство("Узел") Тогда
	    РеквОбъект = Параметры.Узел.ПолучитьОбъект(); 
		ЗначениеВРеквизитФормы(РеквОбъект, "Объект"); 
		Элементы.Код.Доступность = НЕ Объект.ТекущаяБД;
	Иначе
		//Элементы.Код.Доступность = Ложь;
		Элементы.Код.ТолькоПросмотр = ЗначениеЗаполнено(Объект.Код);
		СоздатьСлужебногоПользователяДляОбменаНаСервере();
	КонецЕсли; 
	
	РежимОтладки = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Параметры, "РежимОтладки", Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияФормыВыбораИДОбъекта(ПараметрыВыбора, Параметры) Экспорт
	 
	Если ТипЗнч(ПараметрыВыбора) = Тип("Структура") Тогда
		ТекЭлемент = Элементы.Состав.ТекущиеДанные;
		
		Если ТекЭлемент = Неопределено Тогда
			Возврат;
		КонецЕсли;
		
		ТекЭлемент.Объект = ПараметрыВыбора.ДанныеВыбора;
		ТипXML = ПараметрыВыбора.ТипXML;
		ТекЭлемент.ТипXMLОбъектаИсточника = ТипXML;
		ТекЭлемент.ТипXMLОбъектаПриемника = ТипXML;  //По умолчанию они равны
		//ОбъектПриИзменении("");
	КонецЕсли;
	
КонецПроцедуры 

&НаКлиенте
Процедура СоставОбъектНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	//Если РежимОтладки = Истина Тогда
	//	СтандартнаяОбработка = Не РежимОтладки;
	//	Путь = "\\pivo.local\Resource\Личные\Кириллов ПС\r\ut_2021\work\оду_ОбменДанными.epf";
	//	//ПарамФормы = Новый Структура("Узел", Узел);
	//	ОписОповещФормы = Новый ОписаниеОповещения("ПослеЗакрытияФормыВыбораИДОбъекта", ЭтаФорма);
	//	//пр_Клиент.ОткрытьФормуВнешнейОбработки(Путь, "ФормаВыбораИДОбъекта", ПарамФормы, ЭтаФорма, ОписОповещФормы);//, "оду_ОбменДанными");
	//	пр_Клиент.ОткрытьФормуВнешнейОбработки(Путь, "ФормаВыбораИДОбъекта", , ЭтаФорма, ОписОповещФормы);//, "оду_ОбменДанными");
	//Иначе
		
		ОписОповещФормы = Новый ОписаниеОповещения("ПослеЗакрытияФормыВыбораИДОбъекта", ЭтаФорма); 
		
		//ПарамФормы = Новый Структура("Родитель", ТипОбъекта);
		//ОткрытьФорму("РегистрСведений.оду_НастрокаПриоритетаОбъектаОбмена.Форма.ФормаВыбораОбъекта", 
		//					ПарамФормы, ЭтаФорма,,,, ОписОповещФормы);
		ОткрытьФорму("РегистрСведений.оду_НастрокаПриоритетаОбъектаОбмена.Форма.ФормаВыбораОбъекта", , 
					ЭтаФорма,,,, ОписОповещФормы);
	//КонецЕсли; 

КонецПроцедуры

&НаКлиенте
Процедура ПользовательСсылкаПриИзменении(Элемент)
	Если ЗначениеЗаполнено(Объект.ПользовательСсылка)  Тогда
		СтрРекв = пр_Клиент.ЗначенияРеквизитовОбъекта(Объект.ПользовательСсылка, "Наименование");		
		Объект.Пользователь = НРег(СтрРекв.Наименование);	
	КонецЕсли; 	 
КонецПроцедуры

&НаКлиенте
Процедура ОбъектИсточникКонтраляОстатковПриИзменении(Элемент)
	Если ЗначениеЗаполнено(ОбъектИсточникКонтраляОстатков)  Тогда
		Данные = пр_Клиент.ЗначенияРеквизитовОбъекта(ОбъектИсточникКонтраляОстатков, "ПолноеИмя");
		//ТипXMLОбъектаИсточникаКонтраляОстатков = пр_Общий.ИмяТипаXMLПоСсылке();
		Объект.ТипXMLОбъектаИсточникаКонтраляОстатков = Данные.ПолноеИмя;
	Иначе	
		Объект.ТипXMLОбъектаИсточникаКонтраляОстатков = "";
	КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура СоставОбъектПриИзменении(Элемент) 
	
	ТекЭлемент = Элементы.Состав.ТекущиеДанные;
	
	Если ТекЭлемент = Неопределено Тогда
		Возврат;
	КонецЕсли;
	 
	Если ЗначениеЗаполнено(ТекЭлемент.Объект)  Тогда
		//Данные = пр_Клиент.ЗначенияРеквизитовОбъекта(ОбъектИсточникКонтраляОстатков, "ПолноеИмя");
		Данные = пр_Клиент.ЗначенияРеквизитовОбъекта(ТекЭлемент.Объект, "ЗначениеПустойСсылки");
		ТипXML = пр_Общий.ИмяТипаXMLПоСсылке(Данные.ЗначениеПустойСсылки);
		ТекЭлемент.ТипXMLОбъектаИсточника = ТипXML;
		ТекЭлемент.ТипXMLОбъектаПриемника = ТипXML;  //По умолчанию они равны
		
		ТекЭлемент.Регистрировать = Истина;
		ТекЭлемент.ИспользоватьСамолет = Истина;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КонтрольОстатковОбъектПриИзменении(Элемент)
	
	ТекЭлемент = Элементы.КонтрольОстатков.ТекущиеДанные;
	
	Если ТекЭлемент = Неопределено Тогда
		Возврат;
	КонецЕсли;
	 
	Если ЗначениеЗаполнено(ТекЭлемент.Объект)  Тогда
		//Данные = пр_Клиент.ЗначенияРеквизитовОбъекта(ОбъектИсточникКонтраляОстатков, "ПолноеИмя");
		Данные = пр_Клиент.ЗначенияРеквизитовОбъекта(ТекЭлемент.Объект, "ЗначениеПустойСсылки, ПолноеИмя");
		МТипа = СтрРазделить(Данные.ПолноеИмя, ".", Ложь);
		ИмяТипа = МТипа[0];
		ИмяМД = МТипа[1];
		
		Если ИмяТипа = "РегистрНакопления" Тогда
			ТипXML = "AccumRg." + ИмяМД;
		ИначеЕсли ИмяТипа = "РегистрСведений" Тогда	
			ТипXML = "InfoRg." + ИмяМД;
		Иначе
			ТипXML = пр_Общий.ИмяТипаXMLПоСсылке(Данные.ЗначениеПустойСсылки);
		КонецЕсли;
		
		ТекЭлемент.ТипXMLОбъектаИсточника = ТипXML;
		ТекЭлемент.ТипXMLОбъектаПриемника = ТипXML;  //По умолчанию они равны
		
		ТекЭлемент.Контролировать = Истина;
		
	КонецЕсли;
	
КонецПроцедуры



&НаКлиенте
Процедура ПолучитьИзПриемника(Команда)
	ВыполнитьМетодПодключенияКУчатсникуОбмена("ПолучитьИзПриемника");
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьСвязь(Команда)
	ВыполнитьМетодПодключенияКУчатсникуОбмена("ПроверитьСвязь");
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьМетодПодключенияКУчатсникуОбмена(ИмяМетодаПодключения)
	
	Объект.ИДБазы = "тест";
	Если ПроверитьЗаполнение() Тогда
		Если ИмяМетодаПодключения = "ПолучитьИзПриемника" Тогда
			ПолучитьИзПриемникаНаСервере();
		Иначе
			СтруктураОтвета = СтруктураОтветаУниверсальногоОбмена(, "ping");
			Если ЗначениеЗаполнено(СтруктураОтвета)  Тогда
				Текст = СтруктураОтвета + " Установлена связь с базой - участником обмена";
			Иначе
				Текст = "Не удалось установить связь";
			КонецЕсли; 
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = Текст;
				Сообщение.Сообщить(); 
		КонецЕсли; 
	КонецЕсли; 
	Если Объект.ИДБазы = "тест" Тогда
		Объект.ИДБазы = "";
	КонецЕсли; 

КонецПроцедуры

&НаСервере
Процедура ПолучитьИзПриемникаНаСервере()
	
	Модуль_ОбменУниверсальный = пр_НастройкиПовтИсп.ИсполняемыйМодуль("оду_Общий", пр_НастройкиПовтИсп.ТекущийПользователь());
	Данные = Модуль_ОбменУниверсальный.СтруктураДанныхЭтойБазы();
	
	Если ЗначениеЗаполнено(Данные)  Тогда
		ТелоЗапроса = Модуль_ОбменУниверсальный.СформироватьJSON_Сериализ(Данные);
		//ТелоЗапроса = оду_Общий.СформироватьJSON_Сериализ(СтруктураИзТелаHTTPЗапросаУнив(ОтветHTTP);
		СтруктураОтвета = СтруктураОтветаУниверсальногоОбмена(ТелоЗапроса, "receiverData");
		
		Если ЗначениеЗаполнено(СтруктураОтвета)  Тогда
			Если СтруктураОтвета.code = 200 Тогда
				Результ = Модуль_ОбменУниверсальный.РезультатПроверкиЗаписиНовогоУчастникаОбмена(СтруктураОтвета.data);
				Если Результ = "Уже записан" Тогда
					Сообщение = Новый СообщениеПользователю;
					Сообщение.Текст = Результ;
					Сообщение.Сообщить(); 
				КонецЕсли; 
				ЭтаФорма.Прочитать();
			Иначе
			    Сообщить(СтруктураОтвета.error);
			КонецЕсли; 
		КонецЕсли; 
		
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Функция СтруктураОтветаУниверсальногоОбмена(ТелоЗапроса = Неопределено, Метод)
	
	Модуль = пр_НастройкиПовтИсп.ИсполняемыйМодуль("оду_ОбщийПовтИсп", пр_НастройкиПовтИсп.ТекущийПользователь());
	НастройкиТекущейБД = Модуль.НастройкиТекущейБД();
	ПараметрыПодключения = Модуль.ПараметрыПодключенияУО();
	
	Модуль_ОбменУниверсальный = пр_НастройкиПовтИсп.ИсполняемыйМодуль("оду_Общий", пр_НастройкиПовтИсп.ТекущийПользователь());
	ЗаполнитьЗначенияСвойств(ПараметрыПодключения, Объект); 
	ПараметрыПодключения.ИмяБазыУО = Объект.Код;
	
	СтруктураОтвета = Модуль_ОбменУниверсальный.СтруктураОтветаУниверсальногоОбмена(ПараметрыПодключения, ТелоЗапроса, Метод);
	Возврат СтруктураОтвета;
	
КонецФункции 


&НаКлиенте
Процедура ЗаполнитьИДКонфигурации(Команда)
	Объект.ИДКонфигурации = пр_Общий.ИДКонфигурации();
КонецПроцедуры

&НаКлиенте
Процедура СоздатьСлужебногоПользователяДляОбмена(Команда)
	СоздатьСлужебногоПользователяДляОбменаНаСервере();
КонецПроцедуры

&НаСервере
Процедура СоздатьСлужебногоПользователяДляОбменаНаСервере()
	Модуль = пр_НастройкиПовтИсп.ИсполняемыйМодуль("оду_Общий", пр_НастройкиПовтИсп.ТекущийПользователь()); 
	ДанныеПользователя = Модуль.СоздатьСлужебногоПользователяДляРаботыСОбменом(); 
	
	Если ДанныеПользователя <> Неопределено Тогда
		Объект.Пользователь = ДанныеПользователя.Пользователь; 	
		Объект.Пароль 		= ДанныеПользователя.Пароль; 	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура exchangeStatus(Команда)
	exchangeStatusНаСервере();
КонецПроцедуры

&НаСервере
Процедура exchangeStatusНаСервере()
	
	Модуль = пр_НастройкиПовтИсп.ИсполняемыйМодуль("оду_ОбщийПовтИсп", пр_НастройкиПовтИсп.ТекущийПользователь());
	НастройкиТекущейБД = Модуль.НастройкиТекущейБД();
	ПараметрыПодключения = Модуль.ПараметрыПодключенияПоСсылкеУО(Объект.Ссылка);
	
	Модуль_ОбменУниверсальный = пр_НастройкиПовтИсп.ИсполняемыйМодуль("оду_Общий", пр_НастройкиПовтИсп.ТекущийПользователь());
	
	РезультатОбновления = Модуль_ОбменУниверсальный.ОбновитьСостоянияОбмена(ПараметрыПодключения, НастройкиТекущейБД);
	
КонецПроцедуры
